# SchedulableField Constructor (ScheduleFieldType) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SchedulableField Constructor (ScheduleFieldType)
SchedulableField Class See Also
---
Creates a new SchedulableField.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public SchedulableField(
	ScheduleFieldType fieldType
)
```

Visual Basic
---
```text
Public Sub New ( _
	fieldType As ScheduleFieldType _
)
```

Visual C++
---
```text
public:
SchedulableField(
	ScheduleFieldType fieldType
)
```

# ### Parameters
fieldType
    Type: Autodesk.Revit.DB..::..ScheduleFieldType The type of data displayed by the field.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | fieldType is not a schedulable field type -or- The fieldType can't be CustomField. To create a CustomField, you should use the constructor which receives the custom field server id as a parameter. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
SchedulableField Class
SchedulableField Overload
Autodesk.Revit.DB Namespace